/* Task1 
Написать смоук API тест на логин
  - создать и проверить схему +
  - проверить статус +
  - проверить наличие токена в хедерах +

Task2
Написать смоук API тест на получение всех кастомеров (без фильтрационных параметров) со следующими шагами:
  - Залогиниться +
  - Создать кастомера и проверить 201й статус +
  - Получить всех кастомеров +
  - создать и проверить схему +
  - проверить статус +
  - проверить, что в массиве тела респонса есть созданный кастомер +
  - Проверить поля IsSuccess и ErrorMessage + */
