/* Создайте e2e тест со следующими шагами:
1. Зайти на сайт Sales Portal +
2. Залогиниться с вашими кредами +
3. Перейти на страницу Customers List +
4. Перейти на станицу Add New Customer +
5. Создать покупателя +
6. Проверить наличие покупателя в таблице +
7. Кликнуть на кнопку "Delete" в таблице для созданного покупателя +
8. В модалке удаления кликнуть кнопку Yes, Delete +
9. Дождаться исчезновения модалки и загрузки страницы +
10. Проверить, что покупатель отсутствует в таблице +

Вам понадобится:

- PageObject модалки удаления покупателя
- Подключить модалку в PageObject страницы Customers
- Использовать фикстуры */